In [1]:
import pandas as pd

In [2]:
data = {'firm': ['Bilk Inc.', 'Vine & Co.', 'Kiln Inc.', 'Y & Y Consulting', 'Trending Inc.'],    'fee_2020': [1150, 2300, 3400, 1500, 6500]           }

In [3]:
df= pd.DataFrame(data)
df

               firm  fee_2020
0         Bilk Inc.      1150
1        Vine & Co.      2300
2         Kiln Inc.      3400
3  Y & Y Consulting      1500
4     Trending Inc.      6500

In [4]:
df["fee_2021"] = df["fee_2020"].apply(lambda x: x * 1.1)

In [5]:
df["fee_2022"] = df["fee_2020"].apply(lambda x: x * 1.4)

In [6]:
df["value difference"] = df.apply(lambda x: x["fee_2021"] - x["fee_2020"], axis =1 )

In [7]:
df

               firm  fee_2020  fee_2021  fee_2022  value difference
0         Bilk Inc.      1150    1265.0    1610.0             115.0
1        Vine & Co.      2300    2530.0    3220.0             230.0
2         Kiln Inc.      3400    3740.0    4760.0             340.0
3  Y & Y Consulting      1500    1650.0    2100.0             150.0
4     Trending Inc.      6500    7150.0    9100.0             650.0

In [8]:
df["value difference"]

0    115.0
1    230.0
2    340.0
3    150.0
4    650.0
Name: value difference, dtype: float64

In [9]:
df

               firm  fee_2020  fee_2021  fee_2022  value difference
0         Bilk Inc.      1150    1265.0    1610.0             115.0
1        Vine & Co.      2300    2530.0    3220.0             230.0
2         Kiln Inc.      3400    3740.0    4760.0             340.0
3  Y & Y Consulting      1500    1650.0    2100.0             150.0
4     Trending Inc.      6500    7150.0    9100.0             650.0

In [12]:
df["pchange"] = df.apply(lambda x: ((x["fee_2022"] - x["fee_2021"])/ (x["fee_2021"])*100), axis =1 )

In [13]:
df

               firm  fee_2020  fee_2021  fee_2022  value difference    pchange
0         Bilk Inc.      1150    1265.0    1610.0             115.0  27.272727
1        Vine & Co.      2300    2530.0    3220.0             230.0  27.272727
2         Kiln Inc.      3400    3740.0    4760.0             340.0  27.272727
3  Y & Y Consulting      1500    1650.0    2100.0             150.0  27.272727
4     Trending Inc.      6500    7150.0    9100.0             650.0  27.272727